* Project myocardio 3
** DONE Beginnings
CLOSED: [2024-03-23 Sat 14:44]
:LOGBOOK:
CLOCK: [2024-03-23 Sat 14:44]--[2024-03-23 Sat 14:44] =>  0:00
CLOCK: [2024-03-23 Sat 14:32]--[2024-03-23 Sat 14:44] =>  0:12
CLOCK: [2024-03-16 Sat 09:08]--[2024-03-16 Sat 13:41] =>  4:33
CLOCK: [2024-03-11 Mon 11:15]--[2024-03-11 Mon 11:30] =>  0:15
:END:

- Ziele
  + Tracken von Übungen, Intensitäten und Muskelkater, sodass man progressions machen kann
  + Muskeln nicht doppelt oder zu viel belasten

- Muskelgruppe nach Name
- Übung
  + Liste von Muskelgruppen
- Übung gemacht
  + Datum
  + "Intensität" (also Gewicht, Dauer, ..., einfach ein String)
- Muskelkater
  + Datum
  + Liste von Muskelgruppen

- [X] Anfang
  + lucid-htmx braucht zu altes text
  + Offener issue [[https://github.com/monadicsystems/lucid-htmx/issues/12][hier]]
  + erstmal weglassen und manuell machen
- [X] Jetzt baut er diverse Dependencies und nimmt sie nicht aus Nix heraus.
  + Ihm fehlt zlib
  + =inputsFrom= fälschlicherweise auskommentiert denke ich
  + Japp
- [X] Soreness UI
- [X] Training UI
- [X] "Reset soreness" funzt nicht, 404
- [X] Auf lucid2 wechseln
- [X] Markdown to HTML
  + https://hackage.haskell.org/package/cmark-gfm
- [X] Exercises editierbar, separate JSON-Datei
- [X] Commit training
- [X] Besseres Trainingsformular
  + [X] Letzte Ausführung: wie viel Muskelkater?
  + [X] Besser auf Mobilgeräten
  + [X] Filtere nach Endurance etc. oben
- [X] Übungen editieren einbauen
- [X] Imageupload
  + [X] Formular erweitern
    * Funzt schonmal.
  + [X] Datenbankschema erweitern um Dateien für Exercises
  + [X] Dateien in korrektes Verzeichnis ablegen
  + [X] Dateien serven via scotty static route oder so
    * Braucht's nicht, gibt eh nur einen Pfad
  + [X] Dateien anzeigen und löschbar machen? Oder lieber ganze Exercises?
    * Editieren kann man immerhin schon. Jetzt nur noch Dateien anzeigen und Löschknopf einbauen?
- [X] Bilder auf Containerbreite skalieren
- [X] TOC
- [X] Badges in "Current Workout" sind zu breit
- [X] Scotty-Update
- [X] Übungen eintragen
- [X] Übungsinfos eher in My Workout statt in der Liste?
  + Mal "card" ausprobieren hierfür
  + [X] Übungsliste auch mit Cards
  + [X] "Show details" nochmal testen
- [X] Übersichtlichere Übungsliste: welche Übung gehört zu welchem Muskel?
- [X] Übungen ausblenden, die schon Teil des Trainingsprogramms sind
- [X] Current workout als separater tab
- [X] Badges mit List Groups für Textbrowser
** DONE Rebuild around full page refresh for now
CLOSED: [2024-03-23 Sat 17:29]
:LOGBOOK:
CLOCK: [2024-03-23 Sat 14:45]--[2024-03-23 Sat 17:29] =>  2:44
:END:

- [X] new/edit exercise
  + [X] cancel missing
  + [X] test
- [X] add to workout, remove from workout
- [X] remove from workout from workout view
- [X] soreness
** DONE Improve UX of soreness
CLOSED: [2024-03-24 Sun 08:57]
** DONE Show missing exercises in TOC
CLOSED: [2024-03-24 Sun 09:34]
:LOGBOOK:
CLOCK: [2024-03-24 Sun 08:57]--[2024-03-24 Sun 09:34] =>  0:37
:END:
** DONE Deploy to remote server
CLOSED: [2024-03-24 Sun 11:57]
** TODO Exercises for tibialis anterior
** TODO Better Nix deployment
** TODO Show history of exercises and soreness (textually for now)
:LOGBOOK:
CLOCK: [2024-03-29 Fri 07:50]--[2024-03-29 Fri 12:13] =>  4:23
CLOCK: [2024-03-24 Sun 09:34]--[2024-03-24 Sun 11:58] =>  2:24
:END:

- History in body image?
  + [X] Base image to Nix deployment process
    * We need a static image route
  + [X] Model back image also
  + [X] Function from svg + (muscle, int) pairs to colored svg
  + [X] Color from green to red — how?
    * HSV from green to red has just yellow as intermediate colors — try that
      - [ ] hsv to rgb conversion function?
	+ Or can CSS do it natively?
  + [X] Use with last exercise
  + [X] Doublecheck the results — does it make sense?
    * Core should have ID "core-1"
    * Shoulders were wrong as well
  + [ ] Muscles that aren't trained for a long time should have a lower score as well
  + [ ] Which muscle group do I train more often (relatively plotted again)?
  + [ ] Think about what to visualize exactly
    * Currently sore muscles
    * Map every muscle to scalar value in [0,1], 0 meaning long time no see, 1 recently trained?
    * Map muscle to soreness somehow?
** TODO Add breakpoints in exercise choose and current exercises as well
** TODO Muscle information (what muscle is where and so on)
** TODO Emojis for categories in new exercise form
** TODO Favicon
** CANCELLED Next
CLOSED: [2024-03-23 Sat 17:40]
- [X] Rebuild everything around "full pages" instead of partial updates
- [X] Codec for URLs instead of this "CurrentPage" nonsense right now
  + Get rid of CurrentPage, we can use Strength/Mobility/... in URLs
- [X] Exercise history on current page (einfach List reicht erst mal)
- [X] L.id_ ersetzen durch Funktion die direkt Space wegnimmt
- [X] Progressive enhancement
  + aktuell brauchen wir ja gar nichts dynamisches mehr, können versuchen auf htmx zu verzichten
- [X] Muskelinformationen: wo ist welcher Muskel usw.
  + Am besten auch in DB ablegen unter dem Enum, und mit Markdown-Editor
- [X] Favicon
- [X] Soreness etwas schöner
- [X] Statistiken über Training in Soreness-Ansicht
  + Genauer spezifizieren was wir damit meinen
- [X] Mehr Breakpoints einbauen und Platz ausnutzen
